from pyecharts.charts import Bar
from pyecharts import options as opts

# 您提供的数据
months = ['2021年6月', '2021年7月', '2021年8月', '2021年9月', '2021年10月', '2021年11月', '2021年12月', '2022年1月', '2022年2月', '2022年3月', '2022年4月', '2022年5月', '2022年6月', '2022年7月', '2022年8月', '2022年9月', '2022年10月', '2022年11月', '2022年12月', '2023年1月', '2023年2月', '2023年3月', '2023年4月', '2023年5月', '2023年6月', '2023年7月', '2023年8月', '2023年9月', '2023年10月', '2023年11月', '2023年12月']
unit1_runtime = [445.33, 294.9, 311.45, 277.53, 79.88, 0, 0, 0, 0, 0, 0, 0, 130.78, 348.07, 377.32, 104.78, 11.45, 0, 0, 0, 0, 0, 0, 6.15, 18.48, 111.28, 373.58, 210.6, 52.35, 41.82, 0, 0]
unit2_runtime = [384, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 255.5, 292.77, 42.85, 32.28, 0]
unit3_runtime = [399.2, 249.25, 262.63, 169.7, 83.93, 0, 0, 0, 0, 0, 0, 0, 123.95, 360.55, 359.4, 248.68, 30.92, 3.83, 0, 0, 0, 0, 0, 18.78, 82.92, 200.17, 374.62, 209.68, 43.02, 19.98, 0, 0]

bar = (
    Bar()
    .add_xaxis(months)
    .add_yaxis("冷水机组1运行时长(小时)", unit1_runtime, label_opts=opts.LabelOpts(is_show=False))
    .add_yaxis("冷水机组2运行时长(小时)", unit2_runtime, label_opts=opts.LabelOpts(is_show=False))
    .add_yaxis("冷水机组3运行时长(小时)", unit3_runtime, label_opts=opts.LabelOpts(is_show=False))
    .set_global_opts(
        title_opts=opts.TitleOpts(title="冷水机组运行时长"))
)

bar.render("unit_runtime.html")
